// 基本棋型：长连，连五，活四，冲四（眠四），活三，眠三，活二，眠二，活一，眠一
// 下一子成活 n 就是活 n-1，能成眠 n 就是眠 n-1
// 死四、死三、死二不加入基本棋型里

// 1、2分别代表棋子  0代表空位
// 连五：11111
// 活四：011110
// 冲四：211110  11101  11011
// 活三：011100  011010
// 眠三：211100  211010  210110  11001  10101  2011102
// 活二：001100  011000  001010  010010
// 眠二：211000  210100  210010  10001  2001102  2010102
// 活一：001000  010000
// 眠一：210000  2010002  2001002

// 组合棋型单独给分数 比如双冲四、双活三、冲四活三这些大概率必胜的组合棋型，以及活三眠三、双活二、活二眠二
// 111010111 双冲四
// 111010011 冲四眠三   111010101冲四眠三  111010110冲四眠三

const CHESS_SHAPES = {
  FIVE: '11111',
  FOUR: '011110',
  BLOCKED_FOUR: ['211110', '11101', '11011'],
  THREE: ['011100', '011010'],
  BLOCKED_THREE: ['211100', '211010', '210110', '11001', '10101', '2011102'],
  TWO: ['001100', '011000', '001010', '010010'],
  BLOCKED_TWO: ['211000', '210100', '210010', '10001', '2001102', '2010102'],
  ONE: ['001000', '010000'],
  BLOCKED_ONE: ['210000', '2010002', '2001002']
}

export default CHESS_SHAPES

// 111011011   1110 1 1101